{
    "stats": {
      "HitDice": "1d12",
      "Primary": "Strenght",
      "Saves": "Strenght & Constitution",
      "SavesFormatted": ["Strenght", "Constitution"],
      "Proficiencies": ["Light armor", "medium armor", "shields", "Simple weapons", "martial weapons"]
    },
    "races": ["Half-Elf"],
    "Abilities": [
      {
         "title":"rage",
         "description":"In battle, you fight with primal ferocity. On your turn, you can enter a rage as a bonus action. While raging, you gain the following benefits if you aren’t wearing heavy armor: You have advantage on Strength checks and Strength saving throws. When you make a melee weapon attack using Strength, you gain a bonus to the damage roll that increases as you gain levels as a barbarian, as shown in the Rage Damage column of the Barbarian table. You have resistance to bludgeoning, piercing, and slashing damage. If you are able to cast spells, you can’t cast them or concentrate on them while raging. Your rage lasts for 1 minute. It ends early if you are knocked unconscious or if your turn ends and you haven’t attacked a hostile creature since your last turn or taken damage since then. You can also end your rage on your turn as a bonus action. Once you have raged the number of times shown for your barbarian level in the Rages column of the Barbarian table, you must finish a long rest before you can rage again.",
         "choice": 0,
         "level": 1
      },
      {
         "title":"Unarmored Defense",
         "description":"While you are not wearing any armor, your Armor Class equals 10 + your Dexterity modifier + your Constitution modifier. You can use a shield and still gain this benefit.",
         "choice": 0,
         "level": 1
      },
      {
         "title":"Reckless Attack",
         "description":"Starting at 2nd level, you can throw aside all concern for defense to attack with fierce desperation. When you make your first attack on your turn, you can decide to attack recklessly. Doing so gives you advantage on melee weapon attack rolls using Strength during this turn, but attack rolls against you have advantage until your next turn.",
         "choice": 0,
         "level": 2
      }
   ],
     "Proficiencies":{
      "title":"Proficiencies",
      "description":[{"title": "Armor", "desc": "Light armor, medium armor, shields"}, {"title": "Weapons", "desc": "Simple weapons, martial weapons"}, {"title": "Tools", "desc": "None"}, {"title": "Saving Throws", "desc": "Strength, Constitution"}, {"title": "Skills", "desc": "Choose two from: "}],
      "choice": 2,
      "choices": ["Animal Handling", "Athletics", "Intimidation", "Nature", "Perception", "Survival"],
      "type": "Skills",
      "level": 1
   },
   "HitPoints":{
      "title":"Hit Points",
      "description":[{"title": "Hit Dice", "desc": "1d12 per barbarian level"}, {"title": "Hit Points at 1st Level", "desc": "12 + your Constitution modifier"}, {"title": "Hit Points at Higher Levels", "desc": "1d12 (or 7) + your Constitution modifier per barbarian level after 1st"}],
      "choice": 0,
      "level": 1
   }
 }