{
  "stats": {
    "HitDice": "1d10",
    "Primary": "Dexterity",
    "Saves": "Strength & Dexterity",
    "SavesFormatted": [
      "Strenght",
      "Dexterity"
    ],
    "Proficiencies": [
      "Light armor",
      "medium armor",
      "shields",
      "Simple weapons",
      "martial weapons"
    ]
  },
  "races": [
  ],
  "id": 0,
  "Description": "A fierce warrior of primitive background who can enter a battle rage.",
  "Abilities": [
    {
      "title": "Favored Enemy",
      "description": "Beginning at 1st level, you have significant experience studying, tracking, hunting, and even talking to a certain type of enemy.Choose a type of favored enemy: aberrations, beasts, celestials, constructs, dragons, elementals, fey, fiends, giants, monstrosities, oozes, plants, or undead. Alternatively, you can select two races of humanoid (such as gnolls and orcs) as favored enemies.You have advantage on Wisdom (Survival) checks to track your favored enemies, as well as on Intelligence checks to recall information about them.When you gain this feature, you also learn one language of your choice that is spoken by your favored enemies, if they speak one at all.You choose one additional favored enemy, as well as an associated language, at 6th and 14th level. As you gain levels, your choices should reflect the types of monsters you have encountered on your adventures.",
      "choice": 0,
      "level": 1
    },
    {
      "title": "Natural Explorer",
      "description": "You are particularly familiar with one type of natural environment and are adept at traveling and surviving in such regions. Choose one type of favored terrain: arctic, coast, desert, forest, grassland, mountain, or swamp. When you make an Intelligence or Wisdom check related to your favored terrain, your proficiency bonus is doubled if you are using a skill that you’re proficient in.While traveling for an hour or more in your favored terrain, you gain the following benefits:Difficult terrain doesn’t slow your group’s travel.,Your group can’t become lost except by magical means.,Even when you are engaged in another activity while traveling (such as foraging, navigating, or tracking), you remain alert to danger.,If you are traveling alone, you can move stealthily at a normal pace.,When you forage, you find twice as much food as you normally would.,While tracking other creatures, you also learn their exact number, their sizes, and how long ago they passed through the area.You choose additional favored terrain types at 6th and 10th level.",
      "choice": 0,
      "level": 1
    },
    {
      "title": "Fighting Style",
      "description": "At 2nd level, you adopt a particular style of fighting as your specialty. Choose one of the following options. You can’t take a Fighting Style option more than once, even if you later get to choose again.",
      "choice": 0,
      "level": 2
    },
    {
      "title": "Spellcasting",
      "description": "By the time you reach 2nd level, you have learned to use the magical essence of nature to cast spells, much as a druid does. See chapter 10 for the general rules of spellcasting and chapter 11 for the ranger spell list.",
      "choice": 0,
      "level": 2
    },
    {
      "title": "Ranger Archetype",
      "description": "At 3rd level, you choose an archetype that you strive to emulate: Hunter or Beast Master, both detailed at the end of the class description. Your choice grants you features at 3rd level and again at 7th, 11th, and 15th level.",
      "choice": 0,
      "level": 3
    },
    {
      "title": "Primeval Awareness",
      "description": "Beginning at 3rd level, you can use your action and expend one ranger spell slot to focus your awareness on the region around you. For 1 minute per level of the spell slot you expend, you can sense whether the following types of creatures are present within 1 mile of you (or within up to 6 miles if you are in your favored terrain): aberrations, celestials, dragons, elementals, fey, fiends, and undead. This feature doesn’t reveal the creatures’ location or number.",
      "choice": 0,
      "level": 3
    },
    {
      "title": "Ability Score Improvement",
      "description": "When you reach 4th level, and again at 8th, 12th, 16th, and 19th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can’t increase an ability score above 20 using this feature.",
      "choice": 0,
      "level": 4
    },
    {
      "title": "Extra Attack",
      "description": "Beginning at 5th level, you can attack twice, instead of once, whenever you take the Attack action on your turn.",
      "choice": 0,
      "level": 5
    },
    {
      "title": "Land’s Stride",
      "description": "Starting at 8th level, moving through nonmagical difficult terrain costs you no extra movement. You can also pass through nonmagical plants without being slowed by them and without taking damage from them if they have thorns, spines, or a similar hazard.In addition, you have advantage on saving throws against plants that are magically created or manipulated to impede movement, such those created by the *entangle* spell.",
      "choice": 0,
      "level": 8
    },
    {
      "title": "Hide in Plain Sight",
      "description": "Starting at 10th level, you can spend 1 minute creating camouflage for yourself. You must have access to fresh mud, dirt, plants, soot, and other naturally occurring materials with which to create your camouflage.Once you are camouflaged in this way, you can try to hide by pressing yourself up against a solid surface, such as a tree or wall, that is at least as tall and wide as you are. You gain a +10 bonus to Dexterity (Stealth) checks as long as you remain there without moving or taking actions. Once you move or take an action or a reaction, you must camouflage yourself again to gain this benefit.",
      "choice": 0,
      "level": 10
    },
    {
      "title": "Vanish",
      "description": "Starting at 14th level, you can use the Hide action as a bonus action on your turn. Also, you can’t be tracked by nonmagical means, unless you choose to leave a trail.",
      "choice": 0,
      "level": 14
    },
    {
      "title": "Feral Senses",
      "description": "At 18th level, you gain preternatural senses that help you fight creatures you can’t see. When you attack a creature you can’t see, your inability to see it doesn’t impose disadvantage on your attack rolls against it.You are also aware of the location of any invisible creature within 30 feet of you, provided that the creature isn’t hidden from you and you aren’t blinded or deafened.",
      "choice": 0,
      "level": 18
    }
  ],
  "Proficiencies": {
    "title": "Proficiencies",
    "description": [
      {
        "title": "Armor",
        "desc": "Light armor, medium armor, shields"
      },
      {
        "title": "Weapons",
        "desc": "Simple weapons, martial weapons"
      },
      {
        "title": "Tools",
        "desc": "None"
      },
      {
        "title": "Saving Throws",
        "desc": "Strength, Dexterity"
      },
      {
        "title": "Skills",
        "desc": "Choose two from: "
      }
    ],
    "choice": 3,
    "choices": [
      "Animal Handling",
      "Athletics",
      "Insight",
      "Investigation",
      "Nature",
      "Perception",
      "Stealth",
      "Survival"
    ],
    "type": "Skills",
    "level": 1
  },
  "HitPoints": {
    "title": "Hit Points",
    "description": [
      {
        "title": "Hit Dice",
        "desc": "1d10 per ranger level"
      },
      {
        "title": "Hit Points at 1st Level",
        "desc": "10 + your Constitution modifier"
      },
      {
        "title": "Hit Points at Higher Levels",
        "desc": "1d10 (or 6) + your Constitution modifier per ranger level after 1st"
      }
    ],
    "choice": 0,
    "level": 1
  },
  "Equipments":
      [
         {
            "choice": 1,
            "choices": ["Rapier", "Longsword", "Simple Weapon"]
         },
         {
            "choice": 1,
            "choices": ["Diplomat's pack", "Entertainer’s pack"]
         },
         {
            "choice": 1,
            "choices": ["Lute", "Any other musical instrument"]
         },
         {
            "choice": 0,
            "choices": ["Leather armor", "Dagger"]
         }
      ]
}
